icoStructFoamTest/0/region1/pointDisplacement
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           pointVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }	

    top
    {
        type            zeroGradient;
//        type            fixedValue;
//        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
	type            zeroGradient;
    }
}


// ************************************************************************* //
