icoStructFoamTest/constant/region2/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DT1              DT1 [0 2 -1 0 0 0 0] 2.407e-05;
DT2              DT2 [0 2 -1 0 0 0 0] 2.407e-05;
DT3              DT3 [0 2 -1 0 0 0 0] 9.862e-05;

K1		 K1 [1 1 -3 -1 0 0 0] 34;
K2		 K2 [1 1 -3 -1 0 0 0] 65;
K3		 K3 [1 1 -3 -1 0 0 0] 202.5;


// ************************************************************************* //
