icoStructFoamTest/system/region1/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p               ICCG 1e-06 0;
    U               BICCG 1e-05 0;
    T               ICCG 1e-06 0;
    Udisp           ICCG 1e-06 0;
    cellDisplacement           ICCG 1e-06 0;
 
    cellMotionU PCG
    {
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0;
    };
 }

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}

stressedFoam
{
    nCorrectors     1;
    Udisp               1e-06;
}



// ************************************************************************* //
